In [8]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
import json

In [61]:
df_1 = pd.read_csv("UserIdToGender_Train.csv")

In [62]:
df_1.head()

    userid gender
0  4834460      M
1  4834437      M
2  4834411      F
3  4834405      M
4  4834352      M

In [63]:
df_js = pd.read_json("Urls_data.txt", lines=True)

In [64]:
df_js.head()

,id,title,link,description,long_description,brand,entities,tags,alt_titles
0,ed250aa5d96324b6a5022284ac8fcaa7,Tata-owned JLR launches new luxury SUV- Range ...,https://economictimes.indiatimes.com/industry/...,Default Agency Option of electrification The c...,Default Agency Option of electrification The c...,ET,[Land Rover],NaN,NaN
1,94523652182662ea8997d03008cba45d,"Forget Tesla, this Indian battery can change t...",https://economictimes.indiatimes.com/auto-comp...,"Flipboard Google Plus Forget Tesla, this India...","Flipboard Google Plus Forget Tesla, this India...",ET,[],NaN,NaN
2,8b390899875513973c92c9b014ec962e,Water quality of Ganga has worsened in 3 years...,https://economictimes.indiatimes.com/news/poli...,Flipboard Google Plus Water quality of Ganga h...,Flipboard Google Plus Water quality of Ganga h...,ET,"[Prime Minister Narendra Modi, Ganga]",NaN,NaN
3,061a74f252abfd9f766ca2f45839733c,Statements made by opposition are making enemi...,https://economictimes.indiatimes.com/news/elec...,"Mar 04, 2019, 07.42 AM IST 0Comments PTI He to...","Mar 04, 2019, 07.42 AM IST 0Comments PTI He to...",ET,[Prime Minister Narendra Modi],NaN,NaN
4,fd37fc53607f4255e07b2d30ab788233,Tweet Buster: Top investment tips and what dis...,https://economictimes.indiatimes.com/markets/s...,"Mar 17, 2019, 10.38 AM IST 0Comments AP Tweets...","Mar 17, 2019, 10.38 AM IST 0Comments AP Tweets...",ET,"[Sandip Sabharwal, Basant Maheshwari]",NaN,NaN

In [65]:
len(df_js)

109444

In [66]:
df_js.isnull().sum()

id                       0
title                    0
link                     0
description          19425
long_description     22203
brand                  422
entities              5896
tags                 41866
alt_titles          109434
dtype: int64

In [67]:
df_1.isnull().sum()

userid    0
gender    0
dtype: int64

In [68]:
len(df_1)

229444

In [69]:
df_urltoid = pd.read_csv("part-00000", usecols=range(2))

In [70]:
df_urltoid.head()

    userid                                                url
0  2616607                http://timesofindia.indiatimes.com/
1  2616607  https://timesofindia.indiatimes.com/world/midd...
2  2616607                http://timesofindia.indiatimes.com/
3  2616607                http://timesofindia.indiatimes.com/
4  2616607                http://timesofindia.indiatimes.com/

In [71]:
df_urltoid_1 = pd.read_csv("part-00001", usecols=range(2))
df_urltoid = df_urltoid.append(df_urltoid_1, ignore_index=True)
len(df_urltoid)

9091385

In [72]:
df_urltoid_1 = pd.read_csv("part-00002", usecols=range(2))
df_urltoid = df_urltoid.append(df_urltoid_1, ignore_index=True)
len(df_urltoid)

13746901

In [73]:
df_urltoid_1 = pd.read_csv("part-00003", usecols=range(2))
df_urltoid = df_urltoid.append(df_urltoid_1, ignore_index=True)
len(df_urltoid)

18262506

In [74]:
df_urltoid_1 = pd.read_csv("part-00004", usecols=range(2))
df_urltoid = df_urltoid.append(df_urltoid_1, ignore_index=True)
len(df_urltoid)

22741093

In [75]:
df_urltoid_1 = pd.read_csv("part-00005", usecols=range(2))
df_urltoid = df_urltoid.append(df_urltoid_1, ignore_index=True)
len(df_urltoid)

27307973

In [76]:
df_urltoid_1 = pd.read_csv("part-00006", usecols=range(2))
df_urltoid = df_urltoid.append(df_urltoid_1, ignore_index=True)
len(df_urltoid)

31538235

In [77]:
df_urltoid_1 = pd.read_csv("part-00007", usecols=range(2))
df_urltoid = df_urltoid.append(df_urltoid_1, ignore_index=True)
len(df_urltoid)

36204175

In [78]:
df_urltoid_1 = pd.read_csv("part-00008", usecols=range(2))
df_urltoid = df_urltoid.append(df_urltoid_1, ignore_index=True)
len(df_urltoid)

40768188

In [79]:
df_urltoid_1 = pd.read_csv("part-00009", usecols=range(2))
df_urltoid = df_urltoid.append(df_urltoid_1, ignore_index=True)
len(df_urltoid)

45145164

In [80]:
df_urltoid_1 = pd.read_csv("part-00010", usecols=range(2))
df_urltoid = df_urltoid.append(df_urltoid_1, ignore_index=True)
len(df_urltoid)

49763294

In [81]:
df_urltoid_1 = pd.read_csv("part-00011", usecols=range(2))
df_urltoid = df_urltoid.append(df_urltoid_1, ignore_index=True)
len(df_urltoid)

54459957

In [82]:
df_urltoid.head()

    userid                                                url
0  2616607                http://timesofindia.indiatimes.com/
1  2616607  https://timesofindia.indiatimes.com/world/midd...
2  2616607                http://timesofindia.indiatimes.com/
3  2616607                http://timesofindia.indiatimes.com/
4  2616607                http://timesofindia.indiatimes.com/

In [83]:
# df_urltoidd = df_urltoid.copy()

In [84]:
df_urltoid.drop_duplicates(inplace = True)

In [85]:
len(df_urltoid)

4221165

In [554]:
df = df_1.merge(df_urltoid, on = 'userid', sort = True)

In [555]:
df.head()

   userid gender                                                url
0       5      M     https://m.maharashtratimes.com/topics/wealth/3
1       5      M     https://m.maharashtratimes.com/topics/wealth/2
2     214      M  https://m.gadgetsnow.com/mobile-phones/Xiaomi-...
3     214      M  https://m.gadgetsnow.com/compare-mobile-phones...
4     214      M  https://m.gadgetsnow.com/compare-mobile-phones...

In [556]:
len(df)

2693252

In [557]:
df_js.head()

,id,title,url,description,long_description,brand,entities,tags,alt_titles
0,ed250aa5d96324b6a5022284ac8fcaa7,Tata-owned JLR launches new luxury SUV- Range ...,https://economictimes.indiatimes.com/industry/...,Default Agency Option of electrification The c...,Default Agency Option of electrification The c...,ET,[Land Rover],NaN,NaN
1,94523652182662ea8997d03008cba45d,"Forget Tesla, this Indian battery can change t...",https://economictimes.indiatimes.com/auto-comp...,"Flipboard Google Plus Forget Tesla, this India...","Flipboard Google Plus Forget Tesla, this India...",ET,[],NaN,NaN
2,8b390899875513973c92c9b014ec962e,Water quality of Ganga has worsened in 3 years...,https://economictimes.indiatimes.com/news/poli...,Flipboard Google Plus Water quality of Ganga h...,Flipboard Google Plus Water quality of Ganga h...,ET,"[Prime Minister Narendra Modi, Ganga]",NaN,NaN
3,061a74f252abfd9f766ca2f45839733c,Statements made by opposition are making enemi...,https://economictimes.indiatimes.com/news/elec...,"Mar 04, 2019, 07.42 AM IST 0Comments PTI He to...","Mar 04, 2019, 07.42 AM IST 0Comments PTI He to...",ET,[Prime Minister Narendra Modi],NaN,NaN
4,fd37fc53607f4255e07b2d30ab788233,Tweet Buster: Top investment tips and what dis...,https://economictimes.indiatimes.com/markets/s...,"Mar 17, 2019, 10.38 AM IST 0Comments AP Tweets...","Mar 17, 2019, 10.38 AM IST 0Comments AP Tweets...",ET,"[Sandip Sabharwal, Basant Maheshwari]",NaN,NaN

In [558]:
df_js.rename(columns = {'link': 'url'}, inplace=True)

In [559]:
df_js.head(1)

,id,title,url,description,long_description,brand,entities,tags,alt_titles
0,ed250aa5d96324b6a5022284ac8fcaa7,Tata-owned JLR launches new luxury SUV- Range ...,https://economictimes.indiatimes.com/industry/...,Default Agency Option of electrification The c...,Default Agency Option of electrification The c...,ET,[Land Rover],NaN,NaN

In [560]:
df_js_1 = df_js[['url', 'brand', 'title']]

In [561]:
df_js_1.head()

,url,brand,title
0,https://economictimes.indiatimes.com/industry/...,ET,Tata-owned JLR launches new luxury SUV- Range ...
1,https://economictimes.indiatimes.com/auto-comp...,ET,"Forget Tesla, this Indian battery can change t..."
2,https://economictimes.indiatimes.com/news/poli...,ET,Water quality of Ganga has worsened in 3 years...
3,https://economictimes.indiatimes.com/news/elec...,ET,Statements made by opposition are making enemi...
4,https://economictimes.indiatimes.com/markets/s...,ET,Tweet Buster: Top investment tips and what dis...

In [562]:
df_js.isnull().sum()

id                       0
title                    0
url                      0
description          19425
long_description     22203
brand                  422
entities              5896
tags                 41866
alt_titles          109434
dtype: int64

In [563]:
len(df_js)

109444

In [564]:
df_f = df.merge(df_js_1, on='url')

In [565]:
df_f.head()

,userid,gender,url,brand,title
0,1521071,M,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,"
1,1521071,M,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"News: India News, Latest Bollywood News, Spor"
2,1521071,M,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"News: India News, Latest Bollywood News, Spor"
3,1521071,M,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"News: India News, Latest Bollywood News, Spor"
4,1521071,M,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"News: India News, Latest Bollywood News, Spor"

In [566]:
df_f.drop_duplicates(inplace=True, subset = ['userid', 'gender', 'url'])

In [567]:
df_f.head()

,userid,gender,url,brand,title
0,1521071,M,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,"
24,1521083,M,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,"
48,1521121,M,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,"
72,1521130,M,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,"
96,1521159,F,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,"

In [568]:
len(df_f)

1860766

In [569]:
df_f.isnull().sum()

userid      0
gender      0
url         0
brand     757
title       0
dtype: int64

In [570]:
df_f[df_f['brand'].isnull()]

,userid,gender,url,brand,title
4484347,1529670,M,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
4484348,1551628,M,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
4484349,1576824,M,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
4484350,1618014,M,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
4484351,1659886,M,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
4484352,1691841,M,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
4484353,1731932,M,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
4484354,1784845,M,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
4484355,1808156,M,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
4484356,1831834,M,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
4484357,1836177,M,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
4484358,1843041,M,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
4484359,1863433,M,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
4484360,1871219,F,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
4484361,1895933,M,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
4484362,1931000,M,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
4484363,1979059,M,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
4484364,1993691,M,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
4484365,2026489,M,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
4484366,2056409,M,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
4484367,2101530,M,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
4484368,2117394,M,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
4484369,2119527,M,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
4484370,2143231,F,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
4484371,2191754,M,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
4484372,2206343,M,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
4484373,2230080,M,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
4484374,2273560,M,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
4484375,2299605,M,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
4484376,2319079,M,http://www.breakingbangla.com/2018/09/blog-pos...,NaN,à¦¯à§Œà¦¨ à¦¸à¦™à§�à¦—à¦® à¦›à¦¾à¦¡à¦¼à¦¾à¦“ à...
...,...,...,...,...,...
5798080,4816461,M,https://www.ganeshaspeaks.com/zodiac-signs/sco...,NaN,Scorpio
5801093,3363401,M,https://hindi.sportskeeda.com/cricket/odi-stat...,NaN,à¤�à¤•à¤¦à¤¿à¤µà¤¸à¥€à¤¯ à¤…à¤‚à¤¤à¤°à¤°à¤¾à¤·...
5807198,3667196,M,http://www.ganeshaspeaks.com/hindi/taurus.action,NaN,à¤µà¥ƒà¤·à¤­
5807200,3667196,M,http://www.ganeshaspeaks.com/hindi/pisces.action,NaN,à¤®à¥€à¤¨
5807202,3667196,M,http://www.ganeshaspeaks.com/hindi/libra.action,NaN,à¤¤à¥�à¤²à¤¾
5807203,3667196,M,http://www.ganeshaspeaks.com/hindi/cancer.action,NaN,à¤•à¤°à¥�à¤•
5807205,3667196,M,http://www.ganeshaspeaks.com/hindi/aries.action,NaN,à¤®à¥‡à¤·
5807207,3667196,M,http://www.ganeshaspeaks.com/hindi/virgo.action,NaN,à¤•à¤¨à¥�à¤¯à¤¾
5807209,3667196,M,http://www.ganeshaspeaks.com/hindi/capricorn.a...,NaN,à¤®à¤•à¤°
5807212,3667196,M,http://www.ganeshaspeaks.com/hindi/aquarius.ac...,NaN,à¤•à¥�à¤‚à¤­
5807214,3667196,M,http://www.ganeshaspeaks.com/hindi/sagittarius...,NaN,à¤§à¤¨à¥�
5807223,3667196,M,http://www.ganeshaspeaks.com/hindi/leo.action,NaN,à¤¸à¤¿à¤‚à¤¹
5807225,3667196,M,http://www.ganeshaspeaks.com/hindi/scorpio.action,NaN,à¤µà¥ƒà¤¶à¥�à¤šà¤¿à¤•
5807273,3667196,M,http://livenewsxpress.com/190711/,NaN,à¤¦à¥�à¤¨à¤¿à¤¯à¤¾ à¤­à¤° à¤•à¥‡ à¤•à¤ˆ à¤¸à¤°...
5812252,4027872,M,http://poorvanchalmedia.com/187687/,NaN,à¤›à¤¾à¤¤à¥€ à¤šà¥Œà¤¡à¤¼à¥€ à¤•à¤°à¤¨à¥‡ à¤•à...
5813227,4108576,M,http://timesofindia.indiatimes.com/videos/trai...,NaN,Ee Nagaraniki Emaindi - The Making
5813228,4715418,M,http://timesofindia.indiatimes.com/videos/trai...,NaN,Ee Nagaraniki Emaindi - The Making
5813229,4108576,M,http://timesofindia.indiatimes.com/videos/trai...,NaN,Huttada Sutta - Official Trailer
5813264,4111267,F,http://hindustankhabar.com/353888/,NaN,à¤¸à¥‡à¤•à¥�à¤¸ à¤¦à¥‹ à¤²à¥‹à¤—à¥‹à¤‚ à¤•à¥‡ ...
5813560,4133862,M,https://www.rozanaspokesman.in/,NaN,à¨—à©€à¨¤à¨¾à¨‚ 'à¨š 'à¨¯à¨¾à¨° à¨…à¨¨à¨®à©�à¨...
5813566,4548720,M,https://www.rozanaspokesman.in/,NaN,à¨—à©€à¨¤à¨¾à¨‚ 'à¨š 'à¨¯à¨¾à¨° à¨…à¨¨à¨®à©�à¨...
5813644,4140534,M,https://www.ganeshaspeaks.com/zodiac-signs/leo/,NaN,Leo
5813645,4816461,M,https://www.ganeshaspeaks.com/zodiac-signs/leo/,NaN,Leo
5816161,4398550,M,http://timesofindia.indiatimes.com/videos/cele...,NaN,Bharti Singh ties the knot with Haarsh Limbach...
5819976,4816461,M,https://www.ganeshaspeaks.com/zodiac-signs/gem...,NaN,Gemini
5819978,4816461,M,https://www.ganeshaspeaks.com/zodiac-signs/aries/,NaN,Aries
5819980,4816461,M,https://www.ganeshaspeaks.com/zodiac-signs/virgo/,NaN,Virgo
5819982,4816461,M,https://www.ganeshaspeaks.com/zodiac-signs/pis...,NaN,Pisces
5819984,4816461,M,https://www.ganeshaspeaks.com/zodiac-signs/libra/,NaN,Libra
5819986,4816461,M,https://www.ganeshaspeaks.com/zodiac-signs/aqu...,NaN,Aquarius

In [571]:
def remove_http(s):
    s = s.split("//")
#     s = s[1]
    
    return s[1]

def middle_level_domain(s):
    s = s.split(".")
    l = len(s)
    if(s[0] == 'www' or s[0] == 'm'):
        return s[1]
    elif s[l-2] == 'com':
        return s[0]
    else:
        return s[1]
    
def high_level_url(s):
    s = s.split("/")
    return s[0]

def brand_name(s):
    s = s.split(".")
    if s[0] == 'www':
        return s[1]
    else:
        return s[0]

In [572]:
df_f['url'] = df_f['url'].apply(remove_http)

In [573]:
df_f.head()

,userid,gender,url,brand,title
0,1521071,M,timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,"
24,1521083,M,timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,"
48,1521121,M,timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,"
72,1521130,M,timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,"
96,1521159,F,timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,"

In [574]:
df_f['high_domain'] = df_f['url'].apply(high_level_url)

In [575]:
df_f.head()

,userid,gender,url,brand,title,high_domain
0,1521071,M,timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",timesofindia.indiatimes.com
24,1521083,M,timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",timesofindia.indiatimes.com
48,1521121,M,timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",timesofindia.indiatimes.com
72,1521130,M,timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",timesofindia.indiatimes.com
96,1521159,F,timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",timesofindia.indiatimes.com

In [576]:
df_f['middle_domain'] = df_f['high_domain'].apply(middle_level_domain)

In [577]:
df_f.head()

,userid,gender,url,brand,title,high_domain,middle_domain
0,1521071,M,timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",timesofindia.indiatimes.com,indiatimes
24,1521083,M,timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",timesofindia.indiatimes.com,indiatimes
48,1521121,M,timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",timesofindia.indiatimes.com,indiatimes
72,1521130,M,timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",timesofindia.indiatimes.com,indiatimes
96,1521159,F,timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",timesofindia.indiatimes.com,indiatimes

In [578]:
# df_f['middle_domain'].unique()

In [579]:
df_f['new_brand'] = df_f['high_domain'].apply(brand_name)

In [580]:
df_f.head()

,userid,gender,url,brand,title,high_domain,middle_domain,new_brand
0,1521071,M,timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",timesofindia.indiatimes.com,indiatimes,timesofindia
24,1521083,M,timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",timesofindia.indiatimes.com,indiatimes,timesofindia
48,1521121,M,timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",timesofindia.indiatimes.com,indiatimes,timesofindia
72,1521130,M,timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",timesofindia.indiatimes.com,indiatimes,timesofindia
96,1521159,F,timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",timesofindia.indiatimes.com,indiatimes,timesofindia

In [581]:
# df_f['brand'].unique()

In [582]:
# df_f['new_brand'].unique()

In [583]:
df_f.isnull().sum()

userid             0
gender             0
url                0
brand            757
title              0
high_domain        0
middle_domain      0
new_brand          0
dtype: int64

In [584]:
df_f.drop(['brand', 'high_domain'], inplace = True, axis=1)

In [585]:
df_f.head()

,userid,gender,url,title,middle_domain,new_brand
0,1521071,M,timesofindia.indiatimes.com/,"India News, Latest Sports, Bollywood, World,",indiatimes,timesofindia
24,1521083,M,timesofindia.indiatimes.com/,"India News, Latest Sports, Bollywood, World,",indiatimes,timesofindia
48,1521121,M,timesofindia.indiatimes.com/,"India News, Latest Sports, Bollywood, World,",indiatimes,timesofindia
72,1521130,M,timesofindia.indiatimes.com/,"India News, Latest Sports, Bollywood, World,",indiatimes,timesofindia
96,1521159,F,timesofindia.indiatimes.com/,"India News, Latest Sports, Bollywood, World,",indiatimes,timesofindia

In [586]:
df_f['title'].unique()

array(['India News, Latest Sports, Bollywood, World,',
       'IDBI Bank to sell bad loans, including RComâ€™s',
       'Home-hosting to find new friends', ...,
       "Kalank of theft will end your happiness: Rajasthan Police's Alia Bhatt meme gets a thumbs up from Varun Dhawan",
       "Five years that turned India's concept of news on its headÂ\xa0 Â\xa0 Â\xa0",
       'Crumbling FOBs at Charbagh: Mumbai-like tragedy in waiting?'],
      dtype=object)

In [587]:
from sklearn.preprocessing import LabelEncoder

In [588]:
df = df_f.copy()

In [589]:
df = df.reset_index()

In [593]:
df = df.drop(['index'], axis=1)

In [594]:
df.head()

,userid,gender,url,title,middle_domain,new_brand
0,1521071,M,timesofindia.indiatimes.com/,"India News, Latest Sports, Bollywood, World,",indiatimes,timesofindia
1,1521083,M,timesofindia.indiatimes.com/,"India News, Latest Sports, Bollywood, World,",indiatimes,timesofindia
2,1521121,M,timesofindia.indiatimes.com/,"India News, Latest Sports, Bollywood, World,",indiatimes,timesofindia
3,1521130,M,timesofindia.indiatimes.com/,"India News, Latest Sports, Bollywood, World,",indiatimes,timesofindia
4,1521159,F,timesofindia.indiatimes.com/,"India News, Latest Sports, Bollywood, World,",indiatimes,timesofindia

In [595]:
# df['middle_domain'] = df['middle_domain'].apply(LabelEncoder().fit_transform)

# Label Encoding columns

In [596]:
le = LabelEncoder()

In [597]:
df['gender'] = le.fit_transform(df['gender'])

In [598]:
df['middle_domain'] = le.fit_transform(df['middle_domain'])
df['new_brand'] = le.fit_transform(df['new_brand'])
df.head()

,userid,gender,url,title,middle_domain,new_brand
0,1521071,1,timesofindia.indiatimes.com/,"India News, Latest Sports, Bollywood, World,",42,168
1,1521083,1,timesofindia.indiatimes.com/,"India News, Latest Sports, Bollywood, World,",42,168
2,1521121,1,timesofindia.indiatimes.com/,"India News, Latest Sports, Bollywood, World,",42,168
3,1521130,1,timesofindia.indiatimes.com/,"India News, Latest Sports, Bollywood, World,",42,168
4,1521159,0,timesofindia.indiatimes.com/,"India News, Latest Sports, Bollywood, World,",42,168

In [599]:
df.head()

,userid,gender,url,title,middle_domain,new_brand
0,1521071,1,timesofindia.indiatimes.com/,"India News, Latest Sports, Bollywood, World,",42,168
1,1521083,1,timesofindia.indiatimes.com/,"India News, Latest Sports, Bollywood, World,",42,168
2,1521121,1,timesofindia.indiatimes.com/,"India News, Latest Sports, Bollywood, World,",42,168
3,1521130,1,timesofindia.indiatimes.com/,"India News, Latest Sports, Bollywood, World,",42,168
4,1521159,0,timesofindia.indiatimes.com/,"India News, Latest Sports, Bollywood, World,",42,168

In [600]:
df['title'].unique()

array(['India News, Latest Sports, Bollywood, World,',
       'IDBI Bank to sell bad loans, including RComâ€™s',
       'Home-hosting to find new friends', ...,
       "Kalank of theft will end your happiness: Rajasthan Police's Alia Bhatt meme gets a thumbs up from Varun Dhawan",
       "Five years that turned India's concept of news on its headÂ\xa0 Â\xa0 Â\xa0",
       'Crumbling FOBs at Charbagh: Mumbai-like tragedy in waiting?'],
      dtype=object)

# Trying NLP on title columns (tfidf)

In [601]:
# from sklearn.feature_extraction.text import TfidfVectorizer

In [602]:
# tfidf = TfidfVectorizer(sublinear_tf = True, min_df = 5, stop_words = 'english', encoding='latin-1', ngram_range=(1, 2))

In [603]:
# features = tfidf.fit_transform(df.title).toarray()

In [ ]:
# features.shape

# Trying spark insted sklearn because of memory error

In [ ]:
# from pyspark import SparkContext
# from pyspark.mllib.feature import HashingTF
# from pyspark.mllib.feature import IDF

In [ ]:
# sc = SparkContext()

# # Load documents (one per line).
# # documents = sc.textFile("...").map(lambda line: line.split(" "))

# hashingTF = HashingTF()
# tf = hashingTF.transform(df.title)

# # tf.cache()
# idf = IDF().fit(tf)
# features = idf.transform(tf)

# Using Dask (for parallel computing)

In [ ]:
from dask.distributed import Client

In [ ]:
# client = Client() # start a local Dask client

In [ ]:
# import dask_ml
# from sklearn.externals.joblib import parallel_backend

# Dask on hold()

# Now trying Bag of words

In [661]:
# X_train.shape

In [662]:
# features = tfidf.fit_transform(X_train_counts).toarray()

In [663]:
# df.shape

In [664]:
# X_train_tfidf.shape

In [ ]:
# df['new_title_tfidf'] = df['new_title_tfidf'].apply(X_train_tfidf)

In [665]:
# for i in range(1):
#     print(X_train_tfidf[i])

In [666]:
# X_train_tfidf
df['gender'].value_counts()

1    1693111
0     167655
Name: gender, dtype: int64

In [ ]:
# df[df['gender'] == 0]

In [674]:
# df[df['gender'] == 0]
df[df['title'] == 'India News, Latest Sports, Bollywood, World,']['gender'].value_counts()

1    1
0    1
Name: gender, dtype: int64

In [671]:
df.drop_duplicates(subset=['title', 'url', 'gender'], inplace=True)

In [675]:
from sklearn.feature_extraction.text import CountVectorizer
count_vect = CountVectorizer()
X_train_counts = count_vect.fit_transform(df.title, y=df.gender)
# X_train_counts_1 = count_vect.fit_transform(df.title)
# X_train = X_train_counts.append(X_train_counts_1)
X_train_counts.shape

(100536, 30901)

In [676]:
from sklearn.feature_extraction.text import TfidfTransformer
tfidf = TfidfVectorizer(sublinear_tf = True, min_df = 5, stop_words = 'english', encoding='latin-1', ngram_range=(1, 2))
X_train_tfidf = tfidf_transformer.fit_transform(X_train_counts)
X_train_tfidf.shape

(100536, 30901)

In [773]:
from sklearn.naive_bayes import MultinomialNB
clf = MultinomialNB().fit(X_train_tfidf, df.gender)

In [774]:
# print(clf.predict(count_vect.transform([df['title'][15]])))

In [775]:
df[df['title'] == 'India News, Latest Sports, Bollywood, World,']['gender'].value_counts()

1    1
0    1
Name: gender, dtype: int64

In [776]:
df.reset_index(inplace=True)

In [777]:
df_test = pd.read_csv('UserId_Test.csv')

In [778]:
df_test.head()

    userid
0  1521070
1  1521064
2  1521043
3  1521033
4  1521027

In [779]:
df_test_f = df_test.merge(df_urltoid, on = 'userid')

In [780]:
df_test_f.head()

    userid                                                url
0  1521070                http://timesofindia.indiatimes.com/
1  1521070  https://timesofindia.indiatimes.com/world/midd...
2  1521070  https://timesofindia.indiatimes.com/india/virt...
3  1521070  https://timesofindia.indiatimes.com/india/war-...
4  1521070  https://timesofindia.indiatimes.com/business/i...

In [781]:
df_test_f.drop_duplicates(subset = ['userid', 'url'], inplace = True)

In [782]:
df_test_f.head()

    userid                                                url
0  1521070                http://timesofindia.indiatimes.com/
1  1521070  https://timesofindia.indiatimes.com/world/midd...
2  1521070  https://timesofindia.indiatimes.com/india/virt...
3  1521070  https://timesofindia.indiatimes.com/india/war-...
4  1521070  https://timesofindia.indiatimes.com/business/i...

In [783]:
len(df_test_f)

1527913

In [784]:
len(df_test_f['userid'].unique())

88384

In [785]:
df_test_f_1 = df_test_f.merge(df_js_1, on = 'url')

In [786]:
df_test_f_1.head()

,userid,url,brand,title
0,1521070,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,"
1,1521070,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"News: India News, Latest Bollywood News, Spor"
2,1521070,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"News: India News, Latest Bollywood News, Spor"
3,1521070,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"News: India News, Latest Bollywood News, Spor"
4,1521070,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"News: India News, Latest Bollywood News, Spor"

In [787]:
df_test_f_1.isnull().sum()

userid      0
url         0
brand     618
title       0
dtype: int64

In [698]:
df_test_f_1.head()

,userid,url,brand,title,pred
0,1521070,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",1
1,1521070,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"News: India News, Latest Bollywood News, Spor",1
24,1521043,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",1
25,1521043,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"News: India News, Latest Bollywood News, Spor",1
48,1521033,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",1

In [699]:
df_test_f_1['pred'].value_counts()

1    892402
0    455411
Name: pred, dtype: int64

In [700]:
len(df_test_f_1)

1347813

In [722]:
df_pred = df_test_f_1.drop_duplicates(subset = ['userid', 'pred'])

In [723]:
df_pred.head()

,userid,url,brand,title,pred
0,1521070,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",1
24,1521043,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",1
48,1521033,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",1
72,1521027,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",1
96,1521008,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",1

In [724]:
len(df_pred)

130781

In [725]:
len(df_test['userid'].unique())

88384

In [726]:
df_pred['pred'].value_counts()

1    83640
0    47141
Name: pred, dtype: int64

In [706]:
df_pred.drop(['url', 'title', 'brand'], axis=1, inplace=True)

C:\Users\HP PRO\Anaconda3\lib\site-packages\pandas\core\frame.py:4097: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [707]:
df_pred.head()

     userid  pred
0   1521070     1
24  1521043     1
48  1521033     1
72  1521027     1
96  1521008     1

In [708]:
df_pred.drop_duplicates(subset=['userid'], inplace=True, keep='first')

C:\Users\HP PRO\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [709]:
len(df_pred)

88384

In [710]:
df_pred.head()

     userid  pred
0   1521070     1
24  1521043     1
48  1521033     1
72  1521027     1
96  1521008     1

In [711]:
def num_to_gender(s):
    if s == 1:
        return "M"
    else:
        return "F"

In [712]:
df_pred['gender'] = df_pred['pred'].apply(num_to_gender)

C:\Users\HP PRO\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [713]:
df_pred.head()

     userid  pred gender
0   1521070     1      M
24  1521043     1      M
48  1521033     1      M
72  1521027     1      M
96  1521008     1      M

In [714]:
df_pred.drop('pred', inplace=True, axis=1)

C:\Users\HP PRO\Anaconda3\lib\site-packages\pandas\core\frame.py:4097: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [715]:

df_pred.head()

     userid gender
0   1521070      M
24  1521043      M
48  1521033      M
72  1521027      M
96  1521008      M

In [716]:
len(df_pred)

88384

In [717]:
df_pred.to_csv('submission.csv')

In [718]:
df_pred['gender'].value_counts()

M    78439
F     9945
Name: gender, dtype: int64

In [719]:
df_1['gender'].value_counts()

M    188264
F     41180
Name: gender, dtype: int64

In [720]:
from sklearn.linear_model import LogisticRegression
from sklearn.ensemble import RandomForestClassifier
from sklearn.svm import LinearSVC
from sklearn.model_selection import cross_val_score

In [721]:
svc = LinearSVC().fit(X_train_tfidf, df.gender)

In [727]:
y_pred_svc = svc.predict(count_vect.transform(df_test_f_1['title']))

In [728]:
df_test_f_1['pred_svc'] = y_pred_svc

In [729]:
df_test_f_1.head()

,userid,url,brand,title,pred,pred_svc
0,1521070,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",1,0
1,1521070,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"News: India News, Latest Bollywood News, Spor",1,0
24,1521043,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",1,0
25,1521043,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"News: India News, Latest Bollywood News, Spor",1,0
48,1521033,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",1,0

In [730]:
df_test_f_1['pred_svc'].value_counts()

0    875839
1    471974
Name: pred_svc, dtype: int64

In [732]:
df_pred_svc = df_test_f_1.drop_duplicates(subset = ['userid', 'pred_svc'])

In [733]:
df_pred_svc.head()

,userid,url,brand,title,pred,pred_svc
0,1521070,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",1,0
24,1521043,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",1,0
48,1521033,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",1,0
72,1521027,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",1,0
96,1521008,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",1,0

In [734]:
df_pred_svc.drop(['url', 'brand', 'title', 'pred'], axis=1, inplace=True)

C:\Users\HP PRO\Anaconda3\lib\site-packages\pandas\core\frame.py:4097: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [735]:
df_pred_svc.head()

     userid  pred_svc
0   1521070         0
24  1521043         0
48  1521033         0
72  1521027         0
96  1521008         0

In [736]:
df_pred_svc['pred_svc'].value_counts()

0    76425
1    49488
Name: pred_svc, dtype: int64

In [737]:
df_pred_svc.drop_duplicates(subset=['userid'], inplace=True, keep='first')

C:\Users\HP PRO\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [738]:
df_pred_svc['pred_svc'].value_counts()

0    72259
1    16125
Name: pred_svc, dtype: int64

In [739]:
len(df_pred_svc)

88384

In [740]:
df_pred_svc['gender'] = df_pred_svc['pred_svc'].apply(num_to_gender)

C:\Users\HP PRO\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [741]:
df_pred_svc.drop('pred_svc', inplace=True, axis=1)

C:\Users\HP PRO\Anaconda3\lib\site-packages\pandas\core\frame.py:4097: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [742]:
df_pred_svc.head()

     userid gender
0   1521070      F
24  1521043      F
48  1521033      F
72  1521027      F
96  1521008      F

In [743]:
df_pred_svc.to_csv("submission_svc.csv", index=False)

In [749]:
# df_test_f_1.head()

In [750]:
from sklearn.linear_model import LogisticRegression
from sklearn.ensemble import RandomForestClassifier
from sklearn.svm import LinearSVC
from sklearn.model_selection import cross_val_score
models = [
    RandomForestClassifier(n_estimators=200, max_depth=3, random_state=0),
    LinearSVC(),
    MultinomialNB(),
    LogisticRegression(random_state=0),
]
CV = 5
cv_df = pd.DataFrame(index=range(CV * len(models)))
entries = []
for model in models:
    model_name = model.__class__.__name__
    accuracies = cross_val_score(model, X_train_tfidf, df.gender, scoring='accuracy', cv=CV)
    for fold_idx, accuracy in enumerate(accuracies):
        entries.append((model_name, fold_idx, accuracy))
cv_df = pd.DataFrame(entries, columns=['model_name', 'fold_idx', 'accuracy'])

In [751]:
cv_df.groupby('model_name').accuracy.mean()

model_name
LinearSVC                 0.680683
LogisticRegression        0.736433
MultinomialNB             0.718151
RandomForestClassifier    0.741754
Name: accuracy, dtype: float64

In [752]:
rfc = RandomForestClassifier(n_estimators=200, max_depth=3, random_state=0)

In [753]:
rfc.fit(X_train_tfidf, df.gender)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
            max_depth=3, max_features='auto', max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, n_estimators=200, n_jobs=1,
            oob_score=False, random_state=0, verbose=0, warm_start=False)

In [754]:
y_pred_rfc = rfc.predict(count_vect.transform(df_test_f_1['title']))

In [755]:
df_test_f_1.head(1)

,userid,url,brand,title,pred,pred_svc
0,1521070,http://timesofindia.indiatimes.com/,TIMES OF INDIA,"India News, Latest Sports, Bollywood, World,",1,0

In [756]:
df_pred_rfc = df_test_f_1.copy()

In [758]:
df_pred_rfc.drop(['url', 'brand', 'title', 'pred', 'pred_svc'], axis=1, inplace=True)

In [759]:
df_pred_rfc.head(1)

    userid
0  1521070

In [760]:
df_pred_rfc['gender'] = y_pred_rfc

In [761]:
df_pred_rfc.head(1)

    userid  gender
0  1521070       1

In [762]:
df_pred_rfc['gender'] = df_pred_rfc['gender'].apply(num_to_gender)

In [763]:
df_pred_rfc.head(1)

    userid gender
0  1521070      M

In [764]:
len(df_pred_rfc)

1347813

In [765]:
df_pred_rfc.drop_duplicates(subset=['userid', 'gender'], inplace=True)

In [766]:
len(df_pred_rfc)

88384

In [768]:
df_pred_rfc['gender'].value_counts()

M    88384
Name: gender, dtype: int64

In [767]:
df_pred_rfc.to_csv('submission_rfc.csv', index=False)

In [769]:
clf = MultinomialNB().fit(X_train_tfidf, df.gender)

In [ ]:
y_pred_clf.value_counts()